Repository: Sunnatbek077/TicTacToePro
Catalog: TicTacToePro/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, ja, ko, ru, sv, tr, uk, uz_uz

source: Restart Required
ar: إعادة التشغيل مطلوبة
de: Neustart erforderlich
es: Se requiere reiniciar
fr: Redémarrage requis
ja: 再起動が必要です
ko: 재시작 필요
ru: Требуется перезапуск
sv: Omstart krävs
tr: Yeniden Başlatma Gerekli
uk: Потрібно перезавантажити
uz_uz: Qayta ishga tushirish talab qilinadi

source: Restore default values
ar: استعادة القيم الافتراضية
de: Standardwerte wiederherstellen
es: Restaurar valores predeterminados
fr: Restaurer les valeurs par défaut
ja: デフォルト値を復元する
ko: 기본값 복원
ru: Восстановить значения по умолчанию
sv: Återställ standardvärden
tr: Varsayılan değerleri geri yükle
uk: Відновити значення за замовчуванням
uz_uz: Standart qiymatlarni tiklash

source: Room Code
ar: رمز الغرفة
de: Zimmercode
es: Código de la habitación
fr: Code de la salle
ja: 部屋コード
ko: 객실 코드
ru: Код комнаты
sv: Rumskod
tr: Oda Kodu
uk: Код кімнати
uz_uz: Xona kodi

source: Scoreboard
ar: لوحة النتائج
de: Anzeigetafel
es: Marcador
fr: Tableau des scores
ja: スコアボード
ko: 점수판
ru: Таблица результатов
sv: Resultattavla
tr: Skor tablosu
uk: Табло
uz_uz: Hisob taxtasi

source: Select %@ as starting player
ar: اختر %@ كلاعب يبدأ
de: Wähle %@ als Startspieler
es: Selecciona% @ como jugador/a inicial
fr: Choisir %@ comme premier joueur
ja: %@をスターティングプレイヤーとして選択
ko: %@를 선발 선수로 선택하세요
ru: Выбрать %@ первым игроком
sv: Välj %@ som startspelare
tr: Başlangıç ​​oyuncusu olarak %@'yi seçin.
uk: Виберіть %@ як стартового гравця
uz_uz: Boshlovchi sifatida %@ ni tanlang

source: Select %@ difficulty
ar: اختر مستوى الصعوبة %@
de: Wählen Sie den Schwierigkeitsgrad %@
es: Seleccione %@ dificultad
fr: Choisir la difficulté %@
ja: %@ 難易度を選択
ko: %@난이도를 선택하세요
ru: Выбрать сложность: %@
sv: Välj %@ svårighetsgrad
tr: %@ zorluk seviyesini seçin.
uk: Виберіть %@ складності
uz_uz: %@ qiyinchilik darajasini tanlang

source: Select %@ game mode
ar: اختر وضع اللعبة %@
de: Wähle den Spielmodus %@
es: Seleccionar %@ modo de juego
fr: Choisir le mode de jeu %@
ja: %@ゲームモードを選択
ko: %@ 게임 모드를 선택하세요
ru: Выбрать режим игры: %@
sv: Välj %@ spelläge
tr: %@ oyun modunu seçin
uk: Виберіть ігровий режим %@
uz_uz: %@ oʻyin rejimini tanlang

source: Select one mood at a time
ar: اختر حالة مزاجية واحدة في كل مرة
de: Wählen Sie jeweils eine Stimmung aus.
es: Seleccione un estado de ánimo a la vez
fr: Sélectionnez une humeur à la fois
ja: 一度に1つの気分を選択してください
ko: 한 번에 하나의 감정 상태만 선택하세요.
ru: Выбирайте одно настроение за раз.
sv: Välj ett humör i taget
tr: Her seferinde bir ruh halini seçin.
uk: Вибирайте один настрій за раз
uz_uz: Bir vaqtning o'zida bitta kayfiyatni tanlang

source: Select the duration for your game
ar: اختر مدة لعبتك
de: Wähle die Dauer für dein Spiel aus.
es: Selecciona la duración de tu juego
fr: Choisissez la durée de la partie
ja: ゲームの期間を選択してください
ko: 게임 시간을 선택하세요
ru: Выберите продолжительность игры
sv: Välj spelets längd
tr: Oyununuzun süresini seçin.
uk: Виберіть тривалість для вашої гри
uz_uz: O'yiningiz uchun vaqtni tanlang

source: Select the grid size for your game
ar: اختر حجم الشبكة للعبتك
de: Wählen Sie die Rastergröße für Ihr Spiel aus.
es: Selecciona el tamaño de la cuadrícula para tu juego
fr: Choisissez la taille de la grille
ja: ゲームのグリッドサイズを選択してください
ko: 게임에 맞는 그리드 크기를 선택하세요.
ru: Выберите размер сетки
sv: Välj rutnätsstorlek för ditt spel
tr: Oyununuz için ızgara boyutunu seçin.
uk: Виберіть розмір сітки для вашої гри
uz_uz: O'yiningiz uchun panjara o'lchamini tanlang

source: Selected
ar: تم التحديد
de: Ausgewählt
es: Seleccionad
fr: Sélectionné
ja: 選択済み
ko: 선택된
ru: Выбрано
sv: Vald
tr: Seçildi
uk: Вибрано
uz_uz: Tanlangan

source: Settings
ar: الإعدادات
de: Einstellungen
es: Ajustes
fr: Paramètres
ja: 設定
ko: 설정
ru: Настройки
sv: Inställningar
tr: Ayarlar
uk: Налаштування
uz_uz: Sozlamalar

source: Share this code with your friend
ar: شارك هذا الرمز مع صديقك
de: Teile diesen Code mit deinem Freund
es: Comparte este código con tu amigo/a
fr: Partagez ce code avec votre ami
ja: このコードを友達と共有する
ko: 이 코드를 친구와 공유하세요
ru: Поделитесь этим кодом с другом
sv: Dela den här koden med din vän
tr: Bu kodu arkadaşınızla paylaşın.
uk: Поділіться цим кодом зі своїм другом
uz_uz: Ushbu kodni do'stingiz bilan baham ko'ring

source: Start
ar: يبدأ
es: Comenzar
fr: Commencer
ja: 始める
ko: 시작
ru: Начать
tr: Başlangıç
uk: Початок
uz_uz: Boshlash

source: Start Game
ar: ابدأ اللعبة
de: Spiel starten
es: Iniciar juego
fr: Démarrer la partie
ja: ゲームを開始
ko: 게임 시작
ru: Начать игру
sv: Starta spelet
tr: Oyuna Başla
uk: Почати гру
uz_uz: O'yinni boshlang

source: Start Menu
ar: قائمة ابدأ
de: Startmenü
es: Menú de inicio
fr: Menu Démarrer
ja: スタートメニュー
ko: 시작 메뉴
ru: Меню «Пуск»
sv: Startmeny
tr: Başlangıç ​​Menüsü
uk: Меню «Пуск»
uz_uz: Boshlash menyusi

source: Starting Player
ar: اللاعب الأساسي
de: Startspieler
es: Jugador/a titular
fr: Joueur partant
ja: スターティングプレイヤー
ko: 선발 선수
ru: Игрок стартового состава
sv: Startande spelare
tr: Başlangıç ​​Oyuncusu
uk: Стартовий гравець
uz_uz: Boshlovchi o'yinchi

source: Status
ar: الحالة
es: Estado
fr: Statut
ja: 状態
ko: 상태
ru: Статус
tr: Durum
uk: Статус
uz_uz: Holat

source: Stay
ar: ابق
de: Bleiben
es: Permanecer
fr: Rester
ja: 滞在する
ko: 머무르다
ru: Остаться
sv: Vistelse
tr: Kalmak
uk: Залишатися
uz_uz: Qoling

source: Swipe horizontally to see more options
ar: اسحب أفقيًا لرؤية المزيد من الخيارات
de: Wischen Sie horizontal, um weitere Optionen anzuzeigen.
es: Desliza horizontalmente para ver más opciones
fr: Glissez horizontalement pour plus d'options
ja: 横にスワイプすると、さらに多くのオプションが表示されます
ko: 더 많은 옵션을 보려면 가로로 스와이프하세요.
ru: Проведите по горизонтали для доп. опций
sv: Svep horisontellt för att se fler alternativ
tr: Daha fazla seçenek görmek için yatay olarak kaydırın.
uk: Проведіть пальцем по горизонталі, щоб побачити більше опцій
uz_uz: Ko'proq variantlarni ko'rish uchun gorizontal ravishda suring

source: System
ar: النظام
es: Sistema
fr: Système
ja: システム
ko: 체계
ru: Системная
tr: Sistem
uk: Система
uz_uz: Tizim

source: Tap to select
ar: انقر للتحديد
de: Zum Auswählen tippen
es: Toque para seleccionar
fr: Appuyez pour sélectionner
ja: タップして選択
ko: 탭하여 선택하세요
ru: Нажмите, чтобы выбрать
sv: Tryck för att välja
tr: Seçmek için dokunun
uk: Натисніть, щоб вибрати
uz_uz: Tanlash uchun bosing

source: Theme
ar: السمة
de: Thema
es: Tema
fr: Thème
ja: テーマ
ko: 주제
ru: Тема
sv: Tema
tr: Tema
uk: Тема
uz_uz: Mavzu

source: This will reset all settings to their default values. This action cannot be undone.
ar: سيؤدي ذلك إلى إعادة جميع الإعدادات إلى القيم الافتراضية. لا يمكن التراجع عن هذا الإجراء.
de: Dadurch werden alle Einstellungen auf ihre Standardwerte zurückgesetzt. Diese Aktion kann nicht rückgängig gemacht werden.
es: Esto restablecerá todos los ajustes a sus valores predeterminados. Esta acción no se puede deshacer.
fr: Cela réinitialisera tous les paramètres. Cette action est irréversible.
ja: すべての設定がデフォルト値にリセットされます。この操作は元に戻せません。
ko: 이렇게 하면 모든 설정이 기본값으로 초기화됩니다. 이 작업은 되돌릴 수 없습니다.
ru: Все настройки будут сброшены. Это действие нельзя отменить.
sv: Detta återställer alla inställningar till standardvärdena. Åtgärden kan inte ångras.
tr: Bu işlem tüm ayarları varsayılan değerlerine sıfırlayacaktır. Bu işlem geri alınamaz.
uk: Це скине всі налаштування до значень за замовчуванням. Цю дію не можна скасувати.
uz_uz: Bu barcha sozlamalarni standart qiymatlariga qaytaradi. Bu amalni bekor qilib bo'lmaydi.

source: Ties
ar: تعادلات
de: Krawatten
es: Corbatas
fr: Égalités
ja: 同点
ko: 의
ru: Ничьи
sv: Slipsar
tr: Kravatlar
uk: Краватки
uz_uz: Duranglar

source: Time limit %@
ar: الحد الزمني %@
de: Zeitlimit %@
es: Límite de tiempo %@
fr: Limite de temps %@
ja: 制限時間 %@
ko: 시간 제한 %@
ru: Лимит времени %@
sv: Tidsgräns %@
tr: Süre sınırı %@
uk: Часовий ліміт %@
uz_uz: Vaqt chegarasi %@

source: To apply the language change, the app needs to restart. Your progress will be saved.
ar: لتطبيق تغيير اللغة، يجب إعادة تشغيل التطبيق. سيتم حفظ تقدمك.
de: Um die Sprachänderung anzuwenden, muss die App neu gestartet werden. Ihr Fortschritt wird gespeichert.
es: Para aplicar el cambio de idioma, debes reiniciar la aplicación. Se guardará tu progreso.
fr: Pour que le changement de langue soit pris en compte, l'application doit être redémarrée. Votre progression sera enregistrée.
ja: 言語の変更を適用するには、アプリを再起動する必要があります。進行状況は保存されます。
ko: 언어 변경을 적용하려면 앱을 다시 시작해야 합니다. 진행 상황은 저장됩니다.
ru: Для применения изменения языка необходимо перезапустить приложение. Ваш прогресс будет сохранен.
sv: För att språkändringen ska kunna tillämpas måste appen startas om. Dina framsteg kommer att sparas.
tr: Dil değişikliğinin uygulanması için uygulamanın yeniden başlatılması gerekmektedir. Yaptığınız işlem kaydedilecektir.
uk: Щоб застосувати зміну мови, потрібно перезапустити програму. Ваш прогрес буде збережено.
uz_uz: Til o'zgarishini qo'llash uchun ilovani qayta ishga tushirish kerak. Jarayoningiz saqlanadi.

source: Turn
ar: الدور
es: Doblar
fr: Tour
ja: 振り向く
ko: 회전하다
ru: Ход
sv: Sväng
tr: Dönüş
uk: Ход
uz_uz: Navbati

source: Type message...
ar: اكتب رسالة...
de: Drehen
es: Escribe mensaje...
fr: Écrire un message...
ja: メッセージを入力...
ko: 메시지를 입력하세요...
ru: Введите сообщение...
sv: Skriv meddelande...
tr: Mesaj yazın...
uk: Введіть повідомлення...
uz_uz: Xabar yozing...

source: Version 1.2.2
ar: الإصدار 1.2.2
ja: バージョン1.2.2
ko: 버전 1.2.2
ru: Версия 1.2.2
tr: Sürüm 1.2.2
uk: Версія 1.2.2
uz_uz: 1.2.2 versiyasi

source: VS
ar: مقابل
ja: 対
sv: MOT
uk: ПРОТИ

source: Waiting for opponent...
ar: بانتظار الخصم...
de: Warten auf den Gegner...
es: Esperando (a) al oponente ...
fr: En attente de l'adversaire...
ja: 対戦相手を待っています...
ko: 상대방을 기다리는 중...
ru: Ожидание противника...
sv: Väntar på motståndaren...
tr: Rakibi bekliyorum...
uk: Чекаємо на суперника...
uz_uz: Raqibni kutmoqda...

source: Waiting...
ar: منتظر...
de: Warten...
es: Espera...
ja: 待っている...
ko: 대기 중...
ru: Ожидание...
sv: Väntan...
tr: Beklemek...
uk: Очікування...
uz_uz: Kutilmoqda...

source: Watch
ar: يشاهد
de: Betrachten
es: Mirar
fr: Montre
ja: 時計
ko: 보다
ru: Смотреть
sv: Titta
tr: Kol saati
uk: Дивитися
uz_uz: Ko'rish

source: Welcome!
ar: مرحباً!
de: Willkommen!
es: ¡Bienvenido!
fr: Bienvenu/e!
ja: いらっしゃいませ！
ko: 환영!
ru: Добро пожаловать!
sv: Välkomna!
tr: Hoş geldin!
uk: Ласкаво просимо!
uz_uz: Xush kelibsiz!

source: X wins
ar: X يفوز
de: X gewinnt.
es: X gana
fr: X a gagné
ja: Xが勝つ
ko: X가 이긴다
ru: X победил
sv: X vinster
tr: X kazanır
uk: X перемагає
uz_uz: X g'alaba

source: Your name
ar: اسمك
de: Ihr Name
es: Su nombre
fr: Votre nom
ja: あなたの名前
ko: 당신의 이름
ru: Ваше имя
sv: Ditt namn
tr: Adınız
uk: Ваше ім'я
uz_uz: Sizning ismingiz

source: Your opponent will win this game.
ar: سيتم اعتبار خصمك فائزًا في هذه اللعبة.
de: Dein Gegner wird dieses Spiel gewinnen.
es: Tu oponente ganará este juego.
fr: Votre adversaire gagnera cette partie.
ja: このゲームでは相手が勝利するでしょう。
ko: 상대방이 이 게임에서 이길 겁니다.
ru: Ваш противник выиграет эту игру.
sv: Din motståndare kommer att vinna det här spelet.
tr: Rakibiniz bu oyunu kazanacak.
uk: Ваш суперник виграє цю гру.
uz_uz: Raqibingiz bu o'yinda g'alaba qozonadi.
